# 30917_홍영준_0821_4

# 함수와 메서드 차이 알아보기

```
- 내장함수 : 프로그래 안에 미리 정의 되어있는 함수
  sum, max, print, min
- 패키지 함수
  import pandas as pd
  import matplotlib.pyplot as plt
- 메서드 : 변수가 지니고 있는 함수 이름과 괄호 같이 사용
  df.head().info().tail().shape.describe()
  메서드 = 기술, 어트리뷰트 = 능력치
```

In [2]:
import pandas as pd

In [8]:
df_raw = pd.DataFrame({'Var1':[1,2,2],
                      'Var2':[2,3,2]})

df_raw

   Var1  Var2
0     1     2
1     2     3
2     2     2

In [9]:
df_raw.shape

(3, 2)

In [10]:
# 데이터프레임 복사본 만들기 - .copy()
df_new = df_raw.copy()
df_new

   Var1  Var2
0     1     2
1     2     3
2     2     2

In [11]:
# 변수명 바꾸는 메서드 .rename()
df_new = df_new.rename(columns={'Var2':'V2'})
df_new

   Var1  V2
0     1   2
1     2   3
2     2   2

In [13]:
df_new = df_new.rename(columns={'Var1':'V1'})
df_new

   V1  V2
0   1   2
1   2   3
2   2   2

In [16]:
df = pd.DataFrame({'Var1':[4,3,8],
                   'Var2':[2,6,1]})
df

   Var1  Var2
0     4     2
1     3     6
2     8     1

In [21]:
df['Var_sum'] = df['Var1'] + df['Var2'] # Var1과 Var2를 합한 Var_sum 컬럼 생성하기
df

   Var1  Var2  Var_sum  Var_mean
0     4     2        6       3.0
1     3     6        9       4.5
2     8     1        9       4.5

In [22]:
df['Var_mean'] = df['Var_sum'] / 2 # Var_mean 파생변수 만들기
df

   Var1  Var2  Var_sum  Var_mean
0     4     2        6       3.0
1     3     6        9       4.5
2     8     1        9       4.5

In [24]:
mpg = pd.read_csv('mpg.csv')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [25]:
# mpg 통합 연비 변수 만들기 연습
mpg['total'] = (mpg['cty'] + mpg['hwy'])/2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0

In [29]:
sum(mpg['total'])/len(mpg['total'])

20.14957264957265

In [30]:
# 평균 mean()
mpg['total'].mean()

20.14957264957265